app/Controllers/Transaksi.php

    public function new ()
    {
        $menus = $this->menuModel->findAll();
---
SELECT *
FROM `menu`

    public function storeToCart()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'id_menu' => 'required',
            'jumlah'  => 'required|numeric',
         ], [
            'id_menu' => [
                'required' => 'Menu harus dipilih.',
             ],
            'jumlah'  => [
                'required' => 'Jumlah menu harus diisi.',
                'numeric'  => 'Jumlah menu harus berupa angka.',
             ],
         ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->to('/kasir/transaksi/create')->withInput()->with('errors', $validation->getErrors());
        }

        $id_menu = $this->request->getPost('id_menu');
        $menu    = $this->menuModel->find($id_menu);
---
SELECT *
FROM `menu`
WHERE `menu`.`id_menu` = '3'