app/Models/UserModel.php

    public function getLoggedUser()
    {
        return $this->where([ 'id_user' => session()->get('user_id') ])->first();
---
SELECT *
FROM `user`
WHERE `id_user` = '5'
 LIMIT 1